In [33]:
my_dictionary={
    "name":["person 1,""person 2,","person 3","person 4","person 5"],
    "age":[35,100,34,456,67],
    "salary":[400,500,600,75009,5690],
    }

In [33]:
my_dictionary={
    "name":["person 1,""person 2,","person 3","person 4","person 5"],
    "age":[35,100,34,456,67],
    "salary":[400,500,600,75009,5690],
    }

In [35]:
print(my_dictionary)

{'name': ['person 1,person 2,', 'person 3', 'person 4', 'person 5'], 'age': [35, 100, 34, 456, 67], 'salary': [400, 500, 600, 75009, 5690]}

In [37]:
for key,value in my_dictionary.items():
    print(key,value)

name ['person 1,person 2,', 'person 3', 'person 4', 'person 5']
age [35, 100, 34, 456, 67]
salary [400, 500, 600, 75009, 5690]

In [42]:
print(my_dictionary)

{'name': ['person 1,person 2,', 'person 3', 'person 4', 'person 5'], 'age': [35, 100, 34, 456, 67], 'salary': [400, 500, 600, 75009, 5690], 'location': ['kisumu', 'nakuru', 'mombasa', 'Narok', 'Kericho']}

In [44]:
del my_dictionary["location"]

In [46]:
print(my_dictionary)

{'name': ['person 1,person 2,', 'person 3', 'person 4', 'person 5'], 'age': [35, 100, 34, 456, 67], 'salary': [400, 500, 600, 75009, 5690]}

In [48]:
my_dictionary={
    "name""Rich",
    "age",32,
"salary",34500
}

In [50]:
print(my_dictionary)

{32, 'nameRich', 'age', 'salary', 34500}

In [52]:
import pandas as pd

In [54]:
my_dictionary

{32, 34500, 'age', 'nameRich', 'salary'}

In [56]:
df=pd.DataFrame(my_dictionary)

In [58]:
df

          0
0        32
1  nameRich
2       age
3    salary
4     34500

In [60]:
my_dictionary={
    "name":["person 1,""person 2,","person 3","person 4","person 5"],
    "age":[35,100,34,456,67],
    "salary":[400,500,600,75009,5690]
    }

In [159]:
import pandas as pd

In [161]:
df=pd.DataFrame(my_dictionary)

In [163]:
df

  student  Subject
0   Betty    Maths
1     Kim  Science
2     Ann  English

In [70]:
my_dictionary

{'name': ['person 1,person 2,', 'person 3', 'person 4', 'person 5'],
 'age': [35, 100, 34, 456, 67],
 'salary': [400, 500, 600, 75009, 5690]}

In [74]:
my_dictionary={
    "Maths":[50,67,78,78],
    "student":["joy","Mark","mary","peter"],
    "gender":["female","male","male","female"]
}

In [76]:
my_dictionary

{'Maths': [50, 67, 78, 78],
 'student': ['joy', 'Mark', 'mary', 'peter'],
 'gender': ['female', 'male', 'male', 'female']}

In [78]:
import pandas as pd

In [80]:
df=pd.DataFrame(my_dictionary)

In [82]:
df

   Maths student  gender
0     50     joy  female
1     67    Mark    male
2     78    mary    male
3     78   peter  female

In [84]:
df["student"]

0      joy
1     Mark
2     mary
3    peter
Name: student, dtype: object

In [92]:
df[["Maths","gender"]]

   Maths  gender
0     50  female
1     67    male
2     78    male
3     78  female

In [94]:
df["Maths"]+5

0    55
1    72
2    83
3    83
Name: Maths, dtype: int64

In [96]:
df.dtypes

Maths       int64
student    object
gender     object
dtype: object

In [149]:
student_scores={
"student":["student 1","student 2","student 3"],
"Maths":[70,67,45],
"English":[45,56,90],
"Science":[60,56,70]
}

In [151]:
df = pd.DataFrame(student_scores)

In [153]:
df

     student  Maths  English  Science
0  student 1     70       45       60
1  student 2     67       56       56
2  student 3     45       90       70

In [169]:
df.dtypes

student    object
Subject    object
dtype: object